Table of Contents
 Class ImporterConnectionIdentifier<T>
Namespace
IdeaStatiCa.BimApiLink.Importers
Assembly
IdeaStatiCa.BimApiLink.dll
public abstract class ImporterConnectionIdentifier<T> : AbstractImporter<T>, IImporter<T>, IImporter where T : IIdeaObject
Type Parameters
T
Inheritance
object
ScopeAwareObject
BimLinkObject
AbstractImporter<T>
ImporterConnectionIdentifier<T>
Implements
IImporter<T>
IImporter
Inherited Members
 AbstractImporter<T>.Create<TObj>(Identifier<TObj>)
 AbstractImporter<T>.Create(IIdentifier)
 BimLinkObject.Get<T>(Identifier<T>)
 BimLinkObject.Get<T>(int)
 BimLinkObject.Get<T>(string)
 BimLinkObject.GetMaybe<T>(Identifier<T>)
 BimLinkObject.GetMaybe<T>(int)
 BimLinkObject.GetMaybe<T>(string)
 BimLinkObject.CountryCode
 BimLinkObject.UserData
 ScopeAwareObject.Scope
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Methods
 Create(ConnectionIdentifier<T>)
public abstract T Create(ConnectionIdentifier<T> id)
Parameters
id ConnectionIdentifier<T>
Returns
T
 Create(Identifier<T>)
public override T Create(Identifier<T> identifier)
Parameters
identifier Identifier<T>
Returns
T
 Edit this page